sdmporttest> # Series of tests on the token object
sdmporttest> #
sdmporttest> # create 'token1' and make sure it is empty
sdmporttest> # all checks should fail
sdmporttest> 
sdmporttest> token create token1
token token1: defined
sdmporttest> token status token1
token token1: exists
sdmporttest> token check token1 a b
token token1 check: not set
sdmporttest> token check token1 a b c
token token1 check: not set
sdmporttest> 
sdmporttest> # set a series of two value tokens
sdmporttest> 
sdmporttest> token set token1 a b
token token1: set
sdmporttest> token set token1 c d
token token1: set
sdmporttest> token set token1 e f
token token1: set
sdmporttest> token set token1 g h
token token1: set
sdmporttest> token set token1 i j
token token1: set
sdmporttest> token set token1 k l
token token1: set
sdmporttest> token set token1 m n
token token1: set
sdmporttest> token set token1 o p
token token1: set
sdmporttest> token set token1 q r
token token1: set
sdmporttest> token set token1 s t
token token1: set
sdmporttest> token set token1 u v
token token1: set
sdmporttest> token set token1 w x
token token1: set
sdmporttest> token set token1 y z
token token1: set
sdmporttest> 
sdmporttest> # check to see if the tokens were set identically
sdmporttest> # first list all set items out, then check each one
sdmporttest> # each should succeed
sdmporttest> 
sdmporttest> token status token1
token token1: exists
	a          b                    
	c          d                    
	e          f                    
	g          h                    
	i          j                    
	k          l                    
	m          n                    
	o          p                    
	q          r                    
	s          t                    
	u          v                    
	w          x                    
	y          z                    
sdmporttest> token check token1 a b
token token1 check: set
sdmporttest> token check token1 c d
token token1 check: set
sdmporttest> token check token1 e f
token token1 check: set
sdmporttest> token check token1 g h
token token1 check: set
sdmporttest> token check token1 i j
token token1 check: set
sdmporttest> token check token1 k l
token token1 check: set
sdmporttest> token check token1 m n
token token1 check: set
sdmporttest> token check token1 o p
token token1 check: set
sdmporttest> token check token1 q r
token token1 check: set
sdmporttest> token check token1 s t
token token1 check: set
sdmporttest> token check token1 u v
token token1 check: set
sdmporttest> token check token1 w x
token token1 check: set
sdmporttest> token check token1 y z
token token1 check: set
sdmporttest> 
sdmporttest> # these checks should fail
sdmporttest> 
sdmporttest> token check token1 a b c
token token1 check: not set
sdmporttest> token check token1 d e
token token1 check: not set
sdmporttest> 
sdmporttest> # set a series of three value tokens
sdmporttest> 
sdmporttest> token set token1 g h a
token token1: set
sdmporttest> token set token1 g h b
token token1: set
sdmporttest> token set token1 g h c
token token1: set
sdmporttest> token set token1 g h d
token token1: set
sdmporttest> token set token1 g h e
token token1: set
sdmporttest> token set token1 g h f
token token1: set
sdmporttest> token set token1 g h g
token token1: set
sdmporttest> token set token1 g h i
token token1: set
sdmporttest> token set token1 q h a
token token1: set
sdmporttest> token set token1 q h b
token token1: set
sdmporttest> token set token1 q h c
token token1: set
sdmporttest> token set token1 q h d
token token1: set
sdmporttest> token set token1 q h e
token token1: set
sdmporttest> token set token1 q h f
token token1: set
sdmporttest> token set token1 q h g
token token1: set
sdmporttest> token set token1 q h i
token token1: set
sdmporttest> 
sdmporttest> # check to see if the tokens were set identically
sdmporttest> # first list all set items out, then check each one
sdmporttest> # each should succeed
sdmporttest> 
sdmporttest> token status token1
token token1: exists
	a          b                    
	c          d                    
	e          f                    
	i          j                    
	k          l                    
	m          n                    
	o          p                    
	q          r                    
	s          t                    
	u          v                    
	w          x                    
	y          z                    
	g          h          a         
	g          h          b         
	g          h          c         
	g          h          d         
	g          h          e         
	g          h          f         
	g          h          g         
	g          h          i         
	q          h          a         
	q          h          b         
	q          h          c         
	q          h          d         
	q          h          e         
	q          h          f         
	q          h          g         
	q          h          i         
sdmporttest> token check token1 g h
token token1 check: not set
sdmporttest> token check token1 g h a
token token1 check: set
sdmporttest> token check token1 g h b
token token1 check: set
sdmporttest> token check token1 g h c
token token1 check: set
sdmporttest> token check token1 g h d
token token1 check: set
sdmporttest> token check token1 g h e
token token1 check: set
sdmporttest> token check token1 g h f
token token1 check: set
sdmporttest> token check token1 g h g
token token1 check: set
sdmporttest> token check token1 g h i
token token1 check: set
sdmporttest> token check token1 q h a
token token1 check: set
sdmporttest> token check token1 q h b
token token1 check: set
sdmporttest> token check token1 q h c
token token1 check: set
sdmporttest> token check token1 q h d
token token1 check: set
sdmporttest> token check token1 q h e
token token1 check: set
sdmporttest> token check token1 q h f
token token1 check: set
sdmporttest> token check token1 q h g
token token1 check: set
sdmporttest> token check token1 q h i
token token1 check: set
sdmporttest> 
sdmporttest> # these checks should fail
sdmporttest> 
sdmporttest> token check token1 g h
token token1 check: not set
sdmporttest> token check token1 q h
token token1 check: not set
sdmporttest> 
sdmporttest> # series of tests unsetting and clearing the token
sdmporttest> # all checks should fail
sdmporttest> 
sdmporttest> token unset token1 q h a
token token1: unset
sdmporttest> token check token1 q h a
token token1 check: not set
sdmporttest> token check token1 q h
token token1 check: not set
sdmporttest> token status token1
token token1: exists
	a          b                    
	c          d                    
	e          f                    
	i          j                    
	k          l                    
	m          n                    
	o          p                    
	q          r                    
	s          t                    
	u          v                    
	w          x                    
	y          z                    
	g          h          a         
	g          h          b         
	g          h          c         
	g          h          d         
	g          h          e         
	g          h          f         
	g          h          g         
	g          h          i         
	q          h          b         
	q          h          c         
	q          h          d         
	q          h          e         
	q          h          f         
	q          h          g         
	q          h          i         
sdmporttest> token unset token1 q h
token token1: unset
sdmporttest> token check token1 q h a
token token1 check: not set
sdmporttest> token check token1 q h
token token1 check: not set
sdmporttest> token status token1
token token1: exists
	a          b                    
	c          d                    
	e          f                    
	i          j                    
	k          l                    
	m          n                    
	o          p                    
	q          r                    
	s          t                    
	u          v                    
	w          x                    
	y          z                    
	g          h          a         
	g          h          b         
	g          h          c         
	g          h          d         
	g          h          e         
	g          h          f         
	g          h          g         
	g          h          i         
sdmporttest> token unset token1 q
token token1: unset
sdmporttest> token check token1 q h a
token token1 check: not set
sdmporttest> token check token1 q h
token token1 check: not set
sdmporttest> 
sdmporttest> # these checks should succeed
sdmporttest> 
sdmporttest> token check token1 a b
token token1 check: set
sdmporttest> token check token1 c d
token token1 check: set
sdmporttest> token check token1 e f
token token1 check: set
sdmporttest> token check token1 g h
token token1 check: not set
sdmporttest> token check token1 i j
token token1 check: set
sdmporttest> token check token1 k l
token token1 check: set
sdmporttest> token check token1 m n
token token1 check: set
sdmporttest> token check token1 o p
token token1 check: set
sdmporttest> token check token1 q r
token token1 check: not set
sdmporttest> token check token1 s t
token token1 check: set
sdmporttest> token check token1 u v
token token1 check: set
sdmporttest> token check token1 w x
token token1 check: set
sdmporttest> token check token1 y z
token token1 check: set
sdmporttest> token check token1 g h
token token1 check: not set
sdmporttest> token check token1 g h a
token token1 check: set
sdmporttest> token check token1 g h b
token token1 check: set
sdmporttest> token check token1 g h c
token token1 check: set
sdmporttest> token check token1 g h d
token token1 check: set
sdmporttest> token check token1 g h e
token token1 check: set
sdmporttest> token check token1 g h f
token token1 check: set
sdmporttest> token check token1 g h g
token token1 check: set
sdmporttest> token check token1 g h i
token token1 check: set
sdmporttest> 
sdmporttest> # clear the token out must be empty and all checks must fail
sdmporttest> 
sdmporttest> token clear token1
token token1: cleared
sdmporttest> token status token1
token token1: exists
sdmporttest> token check token1 a b
token token1 check: not set
sdmporttest> token check token1 a b c
token token1 check: not set
sdmporttest> token check token1 c d
token token1 check: not set
sdmporttest> token check token1 d e
token token1 check: not set
sdmporttest> token check token1 e f
token token1 check: not set
sdmporttest> token check token1 g h
token token1 check: not set
sdmporttest> token check token1 g h a
token token1 check: not set
sdmporttest> token check token1 g h b
token token1 check: not set
sdmporttest> token check token1 g h c
token token1 check: not set
sdmporttest> token check token1 g h d
token token1 check: not set
sdmporttest> token check token1 g h e
token token1 check: not set
sdmporttest> token check token1 g h f
token token1 check: not set
sdmporttest> token check token1 g h g
token token1 check: not set
sdmporttest> token check token1 g h i
token token1 check: not set
sdmporttest> token check token1 i j
token token1 check: not set
sdmporttest> token check token1 k l
token token1 check: not set
sdmporttest> token check token1 m n
token token1 check: not set
sdmporttest> token check token1 o p
token token1 check: not set
sdmporttest> token check token1 q h
token token1 check: not set
sdmporttest> token check token1 q h a
token token1 check: not set
sdmporttest> token check token1 q h b
token token1 check: not set
sdmporttest> token check token1 q h c
token token1 check: not set
sdmporttest> token check token1 q h d
token token1 check: not set
sdmporttest> token check token1 q h e
token token1 check: not set
sdmporttest> token check token1 q h f
token token1 check: not set
sdmporttest> token check token1 q h g
token token1 check: not set
sdmporttest> token check token1 q h i
token token1 check: not set
sdmporttest> token check token1 q r
token token1 check: not set
sdmporttest> token check token1 s t
token token1 check: not set
sdmporttest> token check token1 u v
token token1 check: not set
sdmporttest> token check token1 w x
token token1 check: not set
sdmporttest> token check token1 y z
token token1 check: not set
sdmporttest> 
sdmporttest> # delete this token
sdmporttest> 
sdmporttest> token delete token1
token token1: deleted
sdmporttest> 
sdmporttest> # create two tokens for comparison tests
sdmporttest> 
sdmporttest> token create token2
token token2: defined
sdmporttest> token create token3
token token3: defined
sdmporttest> token set token2 a b
token token2: set
sdmporttest> token set token3 a b
token token3: set
sdmporttest> token status token2 token3
token token2: exists
	a          b                    
token token3: exists
	a          b                    
sdmporttest> 
sdmporttest> # comparison should match on all four counts
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = YES token3(token2) = YES
comparison loose: token2(token3) = YES token3(token2) = YES
sdmporttest> token set token2 c d
token token2: set
sdmporttest> token status token2 token3
token token2: exists
	a          b                    
	c          d                    
token token3: exists
	a          b                    
sdmporttest> 
sdmporttest> # comparison should match on all but exact token2 against token3
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = no token3(token2) = YES
comparison loose: token2(token3) = YES token3(token2) = YES
sdmporttest> token set token2 a b c
token token2: set
sdmporttest> token status token2 token3
token token2: exists
	c          d                    
	a          b          c         
token token3: exists
	a          b                    
sdmporttest> 
sdmporttest> # comparison should fail on all four 
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = no token3(token2) = no
comparison loose: token2(token3) = no token3(token2) = no
sdmporttest> token set token3 a b c
token token3: set
sdmporttest> token status token2 token3
token token2: exists
	c          d                    
	a          b          c         
token token3: exists
	a          b          c         
sdmporttest> 
sdmporttest> # comparison should match on all but exact token2 against token3
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = no token3(token2) = YES
comparison loose: token2(token3) = YES token3(token2) = YES
sdmporttest> token unset token2 c d
token token2: unset
sdmporttest> token status token2 token3
token token2: exists
	a          b          c         
token token3: exists
	a          b          c         
sdmporttest> 
sdmporttest> # comparison should match on all four counts
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = YES token3(token2) = YES
comparison loose: token2(token3) = YES token3(token2) = YES
sdmporttest> token set token3 c d e
token token3: set
sdmporttest> token status token2 token3
token token2: exists
	a          b          c         
token token3: exists
	a          b          c         
	c          d          e         
sdmporttest> 
sdmporttest> # comparison should match on all but exact token3 against token2
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = YES token3(token2) = no
comparison loose: token2(token3) = YES token3(token2) = YES
sdmporttest> 
sdmporttest> token set token2 x a
token token2: set
sdmporttest> token set token2 x b
token token2: set
sdmporttest> token set token2 x c
token token2: set
sdmporttest> token set token3 x b
token token3: set
sdmporttest> token unset token3 c d e
token token3: unset
sdmporttest> token status token2 token3
token token2: exists
	a          b          c         
	x          a                    
	x          b                    
	x          c                    
token token3: exists
	a          b          c         
	x          b                    
sdmporttest> 
sdmporttest> # comparison should match exact and loose token3 against token2 only
sdmporttest> 
sdmporttest> token compare token2 token3
comparison exact: token2(token3) = no token3(token2) = YES
comparison loose: token2(token3) = no token3(token2) = YES
sdmporttest> 
sdmporttest> token delete token2
token token2: deleted
sdmporttest> token delete token3
token token3: deleted
sdmporttest> 
sdmporttest> # should be no tokens left
sdmporttest> 
sdmporttest> token status *
sdmporttest> 
sdmporttest> quit
